const names = ["прежний", "административный", "теплый", "женский", "яркий", "серый", "официальный", "английский",
    "французский", "опасный", "богатый", "правовой", "железный", "верный", "дополнительный", "лесной", "горячий",
    "редкий", "массовый", "региональный", "активный", "умный", "летний", "божий", "юридический", "здоровый", "веселый",
    "налоговый", "эффективный", "художественный", "уголовный", "взрослый", "северный", "генеральный", "сегодняшний",
    "древний", "замечательный", "милый", "острый", "лишний", "узкий", "задний", "бедный", "ясный", "синий", "указанный",
    "согласный", "желтый", "творческий", "трудный", "нижний", "культурный", "мягкий", "литературный",
    "сухой", "верхний", "мощный", "обязанный", "жесткий", "морской", "вечный", "спокойный", "ночной", "учебный",
    "медицинский", "промышленный", "свежий", "крепкий", "полезный", "природный", "традиционный", "правильный",
    "партийный", "психологический", "голубой", "православный", "дальний", "совместный", "деревянный", "материальный",
    "виноватый", "понятный", "приятный", "исполнительный", "круглый", "семейный", "транспортный", "домашний",
    "торговый", "резкий", "удивительный", "мужской", "некоторый", "практический", "строгий", "существенный",
    "индивидуальный", "сельский", "невозможный"]
const surnames = ["год", "человек", "день", "вопрос", "глаз", "друг", "дом", "случай", "ребенок", "вид", "конец",
    "город", "закон", "час", "образ", "отец", "результат", "бог", "народ", "голос", "процесс", "суд", "уровень",
    "стол", "президент", "путь", "язык", "взгляд", "момент", "месяц", "порядок", "муж", "вечер", "орган", "рынок",
    "смысл", "театр", "труд", "центр", "сын", "интерес", "век", "автор", "ответ", "совет", "разговор", "мужчина",
    "ряд", "счет", "план", "проект", "материал", "рубль", "документ", "срок", "институт", "ход", "директор", "опыт",
    "принцип", "товарищ", "объект", "гражданин", "период", "состав", "пример", "лес", "палец", "тип", "метод", "брат",
    "представитель", "шаг", "край", "размер", "район", "банк", "начальник", "класс", "зал", "характер", "герой",
    "гость", "воздух", "мальчик", "фильм", "договор", "регион", "выбор", "врач", "факт", "завод", "бизнес", "союз",
    "специалист", "руководитель", "дух", "способ", "хозяин", "доллар"]

export const nameGenerator = () => {
    const indexHandler = (arr: string[]) => Math.floor(Math.random() * arr.length);
    const firstLetterToUpperCase = (arg: string) => arg[0].toUpperCase() + arg.slice(1);
    const name = names[indexHandler(names)];
    const surname = surnames[indexHandler(surnames)];
    return `${firstLetterToUpperCase(name)} ${firstLetterToUpperCase(surname)}`;
}